[
  {
    "Change": "TE/QB Eligibility \"Taysom Hill Rule\"",
    "Area": "Fairness",
    "SupportingInfo": "Regardless of what the platform allows, a QB-eligible player should not be able to gather full-time QB stats at a non-QB position. Examples from the past have been Taysom Hill. One-off plays like a wild-cat snap or a halfback pass will still be counted, this is just against full-time QB stats."
  },
  {
    "Change": "Hosting Platform",
    "Area": "Operations",
    "SupportingInfo": "Yahoo, a good solution for this league for many seasons, has been slipping in recent years. There are other alternatives that exist that may provide the league a better experience. Two options that have been brought up are Sleeper and Fantrax. Some of the benefits they offer are: better mobile apps, a much better draftroom experience, more customization (including defensive scoring to the exact points allowed instead of tiers), and more advanced features that can add some additional fun.<br><br>However there are some downsides to switching platforms. The biggest one is that it will be a lot of work to get the league set up on a new platform, and there is a risk that some of you may not like the new platform or would have to get used to using their specific user interfaces." 
  },
  {
    "Change": "PPR Removal: 7 or 10 REC Yard per point",
    "Area": "Fairness",
    "SupportingInfo": "This change would remove the .5 PPR scoring and instead have 7 or 10 yards per point for receving yards. This continues to help to balance the scoring between RBs and WRs, but does not penalize those WRs who happen to break off long plays more frequently. It also stop rewarding players who catch a ball for a loss or very short yardage- should a zero-yard reception really be equal to a 5-yard run?<br><br>Another way of thinking of this is if two WRs caught a pass using the same exact quick slant route from the 50-yard line... the first broke the defenders ankles and took it the distance for a TD while the second got tackled right away. The second then caught a second and third pass to score a TD. Should the first WR get PENALIZED by a point just because he did his job and scored the very first time he touched the ball instead of getting tackled?<br><br>Below is what the points would look like for certain players using 2024 stats. These show that the 7 REC yards option keeps WR and RB pretty balanced and is very similar to the Half-PPR we currently use. The second example though (Jacobs vs Jefferson) may seem more fair to others in just completely removing PPR.<br><br><img id="ppr" src='https://file.garden/aHv0Hbj9PThoD4eE/Screenshot%202025-07-19%20at%203.11.08%E2%80%AFPM.png'></img>"
  },
  {
    "Change": "Combining the WR and TE positions",
    "Area": "Strategy",
    "SupportingInfo": "This change is more of a 'reflecting the real world' change as NFL teams could theoretically line up in 4 WR sets or 5 WR sets without a TE on the field. Should we make it <b>mandatory</b> to have a TE as a starting position?"
  },
  {
    "Change": "Defensive Scoring",
    "Area": "Fairness",
    "SupportingInfo": "(Requires a change in hosting service) This change would allow for defensive scoring to be more exact, instead of using tiers."
  }
]
